# 안녕하세요^^ 
# AIVLE 미니 프로젝트에 오신 여러분을 환영합니다.
* 본 과정에서는 실제 사례와 데이터를 기반으로 문제를 해결하는 전체 과정을 자기 주도형 실습으로 진행해볼 예정입니다.
* 앞선 교육과정을 정리하는 마음과 지금까지 배운 내용을 바탕으로 문제 해결을 해볼게요!
* 미니 프로젝트를 통한 문제 해결 과정 'A에서 Z까지', 지금부터 시작합니다!

---

# (실습준비) 데이터 불러오기부터

* 17년도부터 21년도 까지의 데이터를 train set, 22년도의 6개월치 데이터를 test set 으로 설정합니다.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as spst
import joblib

In [2]:
# 학습 데이터 로딩
df_total = joblib.load('train.pkl')
df_test = joblib.load('test.pkl')

---

# 1. 데이터 전처리

#### [실습문제1] 열 추가 
* 기존 '기준일ID'열에서 날짜 데이터를 추출하여 새로운 열로 추가 합니다.
    - pd.to_datetime() 함수를 사용해 '기준일ID'열을 datetime 형식으로 변경하겠습니다.
    - year, month, day 열로 기존 데이터 프레임에 연월일 정보를 저장합니다.
    - 데이터 프레임 열에 대해 날짜 정보를 얻을 때에는 **dt.year**, **dt.month**, **dt.day** 속성을 사용합니다.

In [4]:
# 아래에 실습코드를 작성하고 결과를 확인합니다.
df_total['year'], df_total['month'], df_total['day'] = df_total['기준일ID'].dt.year, df_total['기준일ID'].dt.month, df_total['기준일ID'].dt.day
df_total.head(3)

,기준일ID,시간대구분,총생활인구수,남자0세부터9세생활인구수,남자10세부터14세생활인구수,남자15세부터19세생활인구수,남자20세부터24세생활인구수,남자25세부터29세생활인구수,남자30세부터34세생활인구수,남자35세부터39세생활인구수,...,여자40세부터44세생활인구수,여자45세부터49세생활인구수,여자50세부터54세생활인구수,여자55세부터59세생활인구수,여자60세부터64세생활인구수,여자65세부터69세생활인구수,여자70세이상생활인구수,year,month,day
0,2017-01-01,0,31535.2200,1945.4402,566.4588,631.5581,991.9184,1297.1287,1223.1529,1552.9448,...,1029.4360,998.0414,874.5643,1162.1547,1053.0477,964.3940,2025.4819,2017,1,1
1,2017-01-01,1,31188.9174,1930.4766,562.1018,625.2151,1030.6281,1307.7381,1183.0956,1491.5827,...,1027.2574,1038.7528,857.9100,1149.7532,1042.7411,919.0115,2062.2422,2017,1,1
2,2017-01-01,2,31240.4974,1921.1864,559.3965,658.7463,1058.7082,1311.9591,1186.2600,1537.3732,...,1027.8901,1020.0177,853.3890,1193.4472,1011.2073,889.9325,1960.1236,2017,1,1

In [5]:
# 아래에 실습코드를 작성하고 결과를 확인합니다.
df_test['year'], df_test['month'], df_test['day'] = df_test['기준일ID'].dt.year, df_test['기준일ID'].dt.month, df_test['기준일ID'].dt.day
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4344 entries, 0 to 4343
Data columns (total 34 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   기준일ID            4344 non-null   datetime64[ns]
 1   시간대구분            4344 non-null   int64
 2   총생활인구수           4344 non-null   float64
 3   남자0세부터9세생활인구수    4344 non-null   float64
 4   남자10세부터14세생활인구수  4344 non-null   float64
 5   남자15세부터19세생활인구수  4344 non-null   float64
 6   남자20세부터24세생활인구수  4344 non-null   float64
 7   남자25세부터29세생활인구수  4344 non-null   float64
 8   남자30세부터34세생활인구수  4344 non-null   float64
 9   남자35세부터39세생활인구수  4344 non-null   float64
 10  남자40세부터44세생활인구수  4344 non-null   float64
 11  남자45세부터49세생활인구수  4344 non-null   float64
 12  남자50세부터54세생활인구수  4344 non-null   float64
 13  남자55세부터59세생활인구수  4344 non-null   float64
 14  남자60세부터64세생활인구수  4344 non-null   float64
 15  남자65세부터69세생활인구수  4344 non-null   float64
 16  남자70세이상생활인구수     4344 non-null   float64
 17  여자0세부터9세생활인구수    4344 non-null   float64
 18  여자10세부터14세생활인구수  4344 non-null   float64
 19  여자15세부터19세생활인구수  4344 non-null   float64
 20  여자20세부터24세생활인구수  4344 non-null   float64
 21  여자25세부터29세생활인구수  4344 non-null   float64
 22  여자30세부터34세생활인구수  4344 non-null   float64
 23  여자35세부터39세생활인구수  4344 non-null   float64
 24  여자40세부터44세생활인구수  4344 non-null   float64
 25  여자45세부터49세생활인구수  4344 non-null   float64
 26  여자50세부터54세생활인구수  4344 non-null   float64
 27  여자55세부터59세생활인구수  4344 non-null   float64
 28  여자60세부터64세생활인구수  4344 non-null   float64
 29  여자65세부터69세생활인구수  4344 non-null   float64
 30  여자70세이상생활인구수     4344 non-null   float64
 31  year             4344 non-null   int64
 32  month            4344 non-null   int64
 33  day              4344 non-null   int64
dtypes: datetime64[ns](1), float64(29), int64(4)
memory usage: 1.1 MB

#### [실습문제2] 불필요한 열 제거 및 열 이름 변경
* df_total과 df_test에서 '총생활인구수'외에 불필요한 열을 제거 하도록 하겠습니다.
* 시간 데이터를 남기고, '시간대구분' column 을 'hour'로 rename 하도록 하겠습니다.

In [59]:
train = df_total.drop(list(df_total)[3:-3], axis=1)
test = df_test.drop(list(df_test)[3:-3], axis=1)

In [60]:
train['hour'] = train['시간대구분']
test['hour'] = test['시간대구분']

In [61]:
train.drop(['기준일ID', '시간대구분'], axis=1, inplace=True)
test.drop(['기준일ID', '시간대구분'], axis=1, inplace=True)

#### [실습문제3] 시프트 & 롤링
* shift()를 활용하여 이동할 행 수를 지정합니다.
* rolling()을 활용하여 추가할 이동평균 수를 지정합니다.

#### shift()로 일일 생활인구수 평균

In [63]:
train.columns = ['TRP', 'year', 'month', 'day', 'hour']
test.columns = ['TRP', 'year', 'month', 'day', 'hour']

In [64]:
train['TRP_day'] = round(train['TRP'].rolling(7, min_periods=1).mean(), 1)
train.head()

          TRP  year  month  day hour  TRP_day
0  31535.2200  2017      1    1    0  31535.2
1  31188.9174  2017      1    1    1  31362.1
2  31240.4974  2017      1    1    2  31321.5
3  31442.4314  2017      1    1    3  31351.8
4  31922.7751  2017      1    1    4  31466.0

In [65]:
test['TRP_day'] = round(test['TRP'].rolling(7, min_periods=1).mean(), 1)
test.head()

          TRP  year  month  day  hour  TRP_day
0  30509.7386  2022      1    1     0  30509.7
1  30759.5067  2022      1    1     1  30634.6
2  31048.8787  2022      1    1     2  30772.7
3  31076.1092  2022      1    1     3  30848.6
4  31714.9309  2022      1    1     4  31021.8

#### target 값 설정

In [66]:
# target : 일주일 뒤 총생활인구수
train = pd.concat([train, test.iloc[:24*7]], axis=0)  # 행으로 합치기
train['target'] = train['TRP'].shift(-24*7)
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 43680 entries, 0 to 167
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   TRP      43680 non-null  float64
 1   year     43680 non-null  int64
 2   month    43680 non-null  int64
 3   day      43680 non-null  int64
 4   hour     43680 non-null  int64
 5   TRP_day  43680 non-null  float64
 6   target   43512 non-null  float64
dtypes: float64(3), int64(4)
memory usage: 2.7 MB

In [67]:
train.dropna(inplace=True) # null 값을 포함하는 행 삭제
train

              TRP  year  month  day  hour  TRP_day      target
0      31535.2200  2017      1    1     0  31535.2  30716.3268
1      31188.9174  2017      1    1     1  31362.1  30673.4813
2      31240.4974  2017      1    1     2  31321.5  30535.9573
3      31442.4314  2017      1    1     3  31351.8  30884.0372
4      31922.7751  2017      1    1     4  31466.0  31353.9409
...           ...   ...    ...  ...   ...      ...         ...
43507  33060.4555  2021     12   31    19  36846.6  33313.8579
43508  32360.1898  2021     12   31    20  35833.3  33467.1922
43509  31417.3991  2021     12   31    21  34814.8  31867.1341
43510  30763.0563  2021     12   31    22  33921.2  31615.5016
43511  30404.2740  2021     12   31    23  33052.0  32019.4949

[43512 rows x 7 columns]

In [68]:
test['target'] = test['TRP'].shift(-24*7)
test.dropna(inplace=True) # null 값을 포함하는 행 삭제
test

             TRP  year  month  day  hour  TRP_day      target
0     30509.7386  2022      1    1     0  30509.7  32163.4956
1     30759.5067  2022      1    1     1  30634.6  32375.9407
2     31048.8787  2022      1    1     2  30772.7  32817.7526
3     31076.1092  2022      1    1     3  30848.6  33028.2197
4     31714.9309  2022      1    1     4  31021.8  33827.9747
...          ...   ...    ...  ...   ...      ...         ...
4171  32368.9760  2022      6   23    19  37025.4  32969.6040
4172  30551.3557  2022      6   23    20  35609.2  31014.6597
4173  29836.6983  2022      6   23    21  34232.6  30923.2923
4174  30643.8556  2022      6   23    22  33057.3  30509.5463
4175  31539.6470  2022      6   23    23  32209.3  31184.8763

[4176 rows x 7 columns]

#### [실습문제4] 결측치 처리 및 불필요한 열 제거
* 롤링 & 시프트 과정에서 발생한 결측치를 처리하도록 하겠습니다.
* 불필요한 열을 추가로 제거 하겠습니다.(시간 관련 행들)

In [20]:
# 아래에 실습코드를 작성하고 결과를 확인합니다.

In [21]:
# 아래에 실습코드를 작성하고 결과를 확인합니다.

#### [실습문제5] train, test 데이터 나누기
* df_total과 df_test를 각각 train_x, train_y, test_x, test_y 로 나누어 주세요.
* 인덱스를 리셋 해주세요.

In [73]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 43512 entries, 0 to 43511
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   TRP      43512 non-null  float64
 1   year     43512 non-null  int64
 2   month    43512 non-null  int64
 3   day      43512 non-null  int64
 4   hour     43512 non-null  int64
 5   TRP_day  43512 non-null  float64
 6   target   43512 non-null  float64
dtypes: float64(3), int64(4)
memory usage: 2.7 MB

In [77]:
train['year'], train['month'], train['day'], train['hour'] = pd.Categorical(train['year']), pd.Categorical(train['month']), pd.Categorical(train['day']), pd.Categorical(train['hour'])
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 43512 entries, 0 to 43511
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   TRP      43512 non-null  float64
 1   year     43512 non-null  category
 2   month    43512 non-null  category
 3   day      43512 non-null  category
 4   hour     43512 non-null  category
 5   TRP_day  43512 non-null  float64
 6   target   43512 non-null  float64
dtypes: category(4), float64(3)
memory usage: 1.5 MB

In [78]:
test['year'], test['month'], test['day'], test['hour'] = pd.Categorical(test['year']), pd.Categorical(test['month']), pd.Categorical(test['day']), pd.Categorical(test['hour'])
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4176 entries, 0 to 4175
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   TRP      4176 non-null   float64
 1   year     4176 non-null   category
 2   month    4176 non-null   category
 3   day      4176 non-null   category
 4   hour     4176 non-null   category
 5   TRP_day  4176 non-null   float64
 6   target   4176 non-null   float64
dtypes: category(4), float64(3)
memory usage: 149.2 KB

In [79]:
train_x = train.drop('target', axis=1)
train_y = train['target']
test_x = test.drop('target', axis=1)
test_y = test['target']

---

## 다음 단계를 위해서 데이터를 저장하겠습니다.

In [80]:
# CSV로 저장
train_x.to_csv('train_x.csv', index = False)
train_y.to_csv('train_y.csv', index = False)
test_x.to_csv('test_x.csv', index = False)
test_y.to_csv('test_y.csv', index = False)

---